app/Models/User.php

select * from `masters` where `userid` = 5 limit 1
---
	public function master()
	{
		return Master::where('userid', $this->id)->first();